Revit 2024 API
UnitTypeId.NewtonMetersPerMeter Property
 Newton meters per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId NewtonMetersPerMeter { get; }
Visual Basic
Public Shared ReadOnly Property NewtonMetersPerMeter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ NewtonMetersPerMeter {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace